# Bank Loan Portfolio dataset analysis

### Objective
- Risk management, profitability, and strategic decision-making.
- To minimize potential losses due to borrowers failing to repay their loans.

In [3]:
import pandas as pd
df = pd.read_csv("C:\\Users\\mohin\\Downloads\\Bank_Loan_Portfolio.csv")
df

,Loan_ID,Application_Date,City,Region,Age,Employment_Type,Income,Loan_Amount,Loan_Tenure_Months,Interest_Rate_Percent,Credit_Score,Debt_To_Income_Ratio,Approval_Status,Default_Flag,Loan_Status,Customer_Rating,Risk_Category
0,LN102453,13-08-2023,Mumbai,West,43,Self-Employed,90322.0,980052.0,84,10.92,672.0,0.185,Approved,0,Active,4.1,Medium
1,LN100671,26-11-2024,Hyderabad,South,28,Salaried,32617.0,488350.0,54,9.99,698.0,0.345,Approved,0,Paid,4.6,Medium
2,LN100884,07-03-2024,Mumbai,West,34,Business,86468.0,NaN,53,11.56,709.0,0.422,Rejected,0,Rejected,4.4,Medium
3,LN100618,07-04-2023,Mumbai,West,33,Self-Employed,110760.0,1298938.0,59,8.36,730.0,0.243,Approved,0,Active,5.0,Low
4,LN100344,30-05-2023,Mumbai,West,37,Salaried,141338.0,1627058.0,110,10.14,767.0,0.161,Approved,0,Active,4.5,Low
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2995,LN101418,10-10-2023,Hyderabad,South,32,Self-Employed,86405.0,1257301.0,61,10.73,NaN,0.311,Approved,0,Active,5.0,Medium
2996,LN100826,22-08-2024,Chennai,South,39,Salaried,137421.0,1187769.0,80,9.84,736.0,0.148,Rejected,0,Rejected,4.9,Low
2997,LN101442,02-06-2024,Mumbai,West,35,Self-Employed,114418.0,1106424.0,106,9.76,642.0,0.136,approved,0,Active,4.4,High
2998,LN100843,05-03-2024,Delhi,North,31,Salaried,107985.0,1195475.0,106,7.84,625.0,0.145,Rejected,0,Rejected,4.4,High
2999,LN102624,27-02-2024,Mumbai,West,26,Self-Employed,41122.0,440398.0,53,14.00,662.0,0.272,Rejected,0,Rejected,5.0,Medium

In [4]:
df.head()

,Loan_ID,Application_Date,City,Region,Age,Employment_Type,Income,Loan_Amount,Loan_Tenure_Months,Interest_Rate_Percent,Credit_Score,Debt_To_Income_Ratio,Approval_Status,Default_Flag,Loan_Status,Customer_Rating,Risk_Category
0,LN102453,13-08-2023,Mumbai,West,43,Self-Employed,90322.0,980052.0,84,10.92,672.0,0.185,Approved,0,Active,4.1,Medium
1,LN100671,26-11-2024,Hyderabad,South,28,Salaried,32617.0,488350.0,54,9.99,698.0,0.345,Approved,0,Paid,4.6,Medium
2,LN100884,07-03-2024,Mumbai,West,34,Business,86468.0,NaN,53,11.56,709.0,0.422,Rejected,0,Rejected,4.4,Medium
3,LN100618,07-04-2023,Mumbai,West,33,Self-Employed,110760.0,1298938.0,59,8.36,730.0,0.243,Approved,0,Active,5.0,Low
4,LN100344,30-05-2023,Mumbai,West,37,Salaried,141338.0,1627058.0,110,10.14,767.0,0.161,Approved,0,Active,4.5,Low

In [5]:
df.tail()

,Loan_ID,Application_Date,City,Region,Age,Employment_Type,Income,Loan_Amount,Loan_Tenure_Months,Interest_Rate_Percent,Credit_Score,Debt_To_Income_Ratio,Approval_Status,Default_Flag,Loan_Status,Customer_Rating,Risk_Category
2995,LN101418,10-10-2023,Hyderabad,South,32,Self-Employed,86405.0,1257301.0,61,10.73,NaN,0.311,Approved,0,Active,5.0,Medium
2996,LN100826,22-08-2024,Chennai,South,39,Salaried,137421.0,1187769.0,80,9.84,736.0,0.148,Rejected,0,Rejected,4.9,Low
2997,LN101442,02-06-2024,Mumbai,West,35,Self-Employed,114418.0,1106424.0,106,9.76,642.0,0.136,approved,0,Active,4.4,High
2998,LN100843,05-03-2024,Delhi,North,31,Salaried,107985.0,1195475.0,106,7.84,625.0,0.145,Rejected,0,Rejected,4.4,High
2999,LN102624,27-02-2024,Mumbai,West,26,Self-Employed,41122.0,440398.0,53,14.00,662.0,0.272,Rejected,0,Rejected,5.0,Medium

In [6]:
df.duplicated().sum()

44

In [7]:
duplicated_rows = df[df.duplicated(keep=False)]
print(duplicated_rows)

       Loan_ID Application_Date       City Region  Age Employment_Type  \
13    LN100322       09-02-2024    Chennai  South   28        Salaried
57    LN101226       05-05-2024    Chennai  South   39        Salaried
102   LN102505       15-06-2024    Chennai  South   42        Salaried
132   LN102579       06-12-2023    Chennai  South   42        Business
183   LN100289       25-09-2023  Hyderabad  South   37        Business
...        ...              ...        ...    ...  ...             ...
2773  LN100063       05-05-2024       Pune   West   39        Business
2822  LN100194       30-12-2023  Bengaluru  South   27   Self-Employed
2834  LN100322       09-02-2024    Chennai  South   28        Salaried
2868  LN102851       19-11-2023    Chennai  South   21             NaN
2940  LN100052       10-06-2024       pune   West   33        Salaried

        Income  Loan_Amount  Loan_Tenure_Months  Interest_Rate_Percent  \
13    105710.0     570605.0                  43               9.340000
57     60401.0     257897.0                  66              11.520000
102    75214.0     476919.0                  69               9.370000
132    44307.0     489558.0                  78              40.447347
183    90066.0     629868.0                 107              10.320000
...        ...          ...                 ...                    ...
2773   67690.0    1176702.0                  91              10.920000
2822  100613.0     861637.0                  88              13.000000
2834  105710.0     570605.0                  43               9.340000
2868   88743.0    1162186.0                  34              10.910000
2940   71052.0     399358.0                  74               9.330000

      Credit_Score  Debt_To_Income_Ratio Approval_Status  Default_Flag  \
13           790.0                 0.148        Approved             0
57           786.0                 0.088        Approved             0
102          737.0                 0.119        Approved             0
132          623.0                 0.204        rejected             0
183          688.0                 0.100        Rejected             0
...            ...                   ...             ...           ...
2773         702.0                 0.282        Rejected             0
2822           NaN                 0.151        Rejected             0
2834         790.0                 0.148        Approved             0
2868         753.0                 0.450        Rejected             0
2940         676.0                 0.100        Approved             0

     Loan_Status  Customer_Rating Risk_Category
13          Paid              4.5           Low
57        Active              5.0           Low
102       Active              5.0           Low
132     Rejected              4.8          High
183     Rejected              4.1        Medium
...          ...              ...           ...
2773    Rejected              5.0        Medium
2822    Rejected              3.6        Medium
2834        Paid              4.5           Low
2868    Rejected              5.0        Medium
2940      Active              5.0        Medium

[88 rows x 17 columns]

In [8]:
df.isnull().sum()

Loan_ID                    0
Application_Date           0
City                       0
Region                     0
Age                        0
Employment_Type          120
Income                   120
Loan_Amount              121
Loan_Tenure_Months         0
Interest_Rate_Percent      0
Credit_Score             121
Debt_To_Income_Ratio       0
Approval_Status            0
Default_Flag               0
Loan_Status                0
Customer_Rating            0
Risk_Category              0
dtype: int64

In [9]:
df['Employment_Type'].fillna('Unknown',inplace=True)

C:\Users\mohin\AppData\Local\Temp\ipykernel_13240\1881295917.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Employment_Type'].fillna('Unknown',inplace=True)

In [10]:
median_income = df['Income'].median()
# fill missing values
df['Income'].fillna(median_income,inplace=True)

C:\Users\mohin\AppData\Local\Temp\ipykernel_13240\1750826799.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Income'].fillna(median_income,inplace=True)

In [11]:
median_loan_amount = df['Loan_Amount'].median()
df['Loan_Amount'].fillna(median_loan_amount,inplace=True)

C:\Users\mohin\AppData\Local\Temp\ipykernel_13240\3644180439.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Loan_Amount'].fillna(median_loan_amount,inplace=True)

In [12]:
median_credit_score = df['Credit_Score'].median()
df['Credit_Score'].fillna(median_credit_score,inplace=True)

C:\Users\mohin\AppData\Local\Temp\ipykernel_13240\822183356.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Credit_Score'].fillna(median_credit_score,inplace=True)

In [13]:
df.isnull().sum()

Loan_ID                  0
Application_Date         0
City                     0
Region                   0
Age                      0
Employment_Type          0
Income                   0
Loan_Amount              0
Loan_Tenure_Months       0
Interest_Rate_Percent    0
Credit_Score             0
Debt_To_Income_Ratio     0
Approval_Status          0
Default_Flag             0
Loan_Status              0
Customer_Rating          0
Risk_Category            0
dtype: int64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 17 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Loan_ID                3000 non-null   object
 1   Application_Date       3000 non-null   object
 2   City                   3000 non-null   object
 3   Region                 3000 non-null   object
 4   Age                    3000 non-null   int64
 5   Employment_Type        3000 non-null   object
 6   Income                 3000 non-null   float64
 7   Loan_Amount            3000 non-null   float64
 8   Loan_Tenure_Months     3000 non-null   int64
 9   Interest_Rate_Percent  3000 non-null   float64
 10  Credit_Score           3000 non-null   float64
 11  Debt_To_Income_Ratio   3000 non-null   float64
 12  Approval_Status        3000 non-null   object
 13  Default_Flag           3000 non-null   int64
 14  Loan_Status            3000 non-null   object
 15  Customer_Rating        3000 non-null   float64
 16  Risk_Category          3000 non-null   object
dtypes: float64(6), int64(3), object(8)
memory usage: 398.6+ KB

In [15]:
df.columns

Index(['Loan_ID', 'Application_Date', 'City', 'Region', 'Age',
       'Employment_Type', 'Income', 'Loan_Amount', 'Loan_Tenure_Months',
       'Interest_Rate_Percent', 'Credit_Score', 'Debt_To_Income_Ratio',
       'Approval_Status', 'Default_Flag', 'Loan_Status', 'Customer_Rating',
       'Risk_Category'],
      dtype='object')

In [30]:
df.shape

(3000, 17)

In [32]:
df.nunique()

Loan_ID                  2956
Application_Date          720
City                       12
Region                      3
Age                        36
Employment_Type             7
Income                   2733
Loan_Amount              2739
Loan_Tenure_Months        121
Interest_Rate_Percent     613
Credit_Score              300
Debt_To_Income_Ratio      474
Approval_Status             4
Default_Flag                2
Loan_Status                 8
Customer_Rating            36
Risk_Category               6
dtype: int64

In [34]:
df['City'].value_counts()

City
Delhi        523
Chennai      492
Mumbai       491
Pune         483
Bengaluru    469
Hyderabad    452
mumbai        19
bengaluru     17
delhi         15
pune          14
hyderabad     13
chennai       12
Name: count, dtype: int64

In [36]:
df['Region'].value_counts()

Region
South    1455
West     1007
North     538
Name: count, dtype: int64

In [58]:
df[(df['City']=='Delhi') & (df['Income']>=100000)]

,Loan_ID,Application_Date,City,Region,Age,Employment_Type,Income,Loan_Amount,Loan_Tenure_Months,Interest_Rate_Percent,Credit_Score,Debt_To_Income_Ratio,Approval_Status,Default_Flag,Loan_Status,Customer_Rating,Risk_Category
10,LN102256,07-12-2024,Delhi,North,31,Business,147116.0,1659907.0,83,10.27,705.0,0.190,Approved,0,Active,5.0,Medium
44,LN102832,17-08-2024,Delhi,North,24,Business,103767.0,1155257.0,98,12.48,625.0,0.182,Rejected,0,Rejected,4.6,High
50,LN100471,04-10-2023,Delhi,North,21,Salaried,129953.0,1418886.0,63,10.28,814.0,0.225,approved,0,Paid,5.0,Low
95,LN102734,09-11-2024,Delhi,North,46,Self-Employed,118476.0,1601589.0,73,10.66,690.0,0.252,Approved,0,Active,3.6,Medium
103,LN102334,23-10-2023,Delhi,North,34,Self-Employed,106708.0,1300817.0,104,10.38,734.0,0.178,Approved,0,Paid,5.0,Low
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2901,LN102955,17-05-2023,Delhi,North,26,Salaried,117997.0,908088.0,69,9.48,764.0,0.145,Rejected,0,Rejected,5.0,Low
2937,LN102541,15-09-2024,Delhi,North,31,Salaried,120975.0,1401579.0,114,10.60,797.0,0.162,Approved,0,Paid,4.3,Low
2965,LN100342,10-05-2024,Delhi,North,32,Salaried,122930.0,1180549.0,50,11.83,753.0,0.244,Approved,0,Paid,4.8,Low
2984,LN100255,15-05-2023,Delhi,North,38,Salaried,157965.0,1356092.0,105,8.91,658.0,0.118,Rejected,0,Rejected,4.9,Medium
2998,LN100843,05-03-2024,Delhi,North,31,Salaried,107985.0,1195475.0,106,7.84,625.0,0.145,Rejected,0,Rejected,4.4,High

In [62]:
region_wise_loan_amount = df.groupby('Region')['Loan_Amount'].mean().sort_values(ascending=False)
region_wise_loan_amount

Region
South    919576.793395
West     913250.002612
North    878389.417933
Name: Loan_Amount, dtype: float64

In [64]:
df['Employment_Type'].value_counts()

Employment_Type
Salaried         1634
Self-Employed     590
Business          570
Unknown           120
salaried           48
self-employed      22
business           16
Name: count, dtype: int64

In [66]:
emp_type_wise_loan_amount = df.groupby('Employment_Type')['Loan_Amount'].mean().sort_values(ascending=False)
emp_type_wise_loan_amount

Employment_Type
Business         930446.523898
Salaried         912053.817129
salaried         898234.626125
Self-Employed    895827.181026
Unknown          892171.446792
self-employed    871570.727273
business         728850.598938
Name: Loan_Amount, dtype: float64

In [68]:
df.describe(include='all')

,Loan_ID,Application_Date,City,Region,Age,Employment_Type,Income,Loan_Amount,Loan_Tenure_Months,Interest_Rate_Percent,Credit_Score,Debt_To_Income_Ratio,Approval_Status,Default_Flag,Loan_Status,Customer_Rating,Risk_Category
count,3000,3000,3000,3000,3000.000000,3000,3000.000000,3.000000e+03,3000.000000,3000.000000,3000.000000,3000.000000,3000,3000.000000,3000,3000.000000,3000
unique,2956,720,12,3,NaN,7,NaN,NaN,NaN,NaN,NaN,NaN,4,NaN,8,NaN,6
top,LN101411,11-06-2023,Delhi,South,NaN,Salaried,NaN,NaN,NaN,NaN,NaN,NaN,Approved,NaN,Active,NaN,Medium
freq,2,13,523,1455,NaN,1634,NaN,NaN,NaN,NaN,NaN,NaN,1947,NaN,1057,NaN,1337
mean,NaN,NaN,NaN,NaN,34.173667,NaN,84514.388333,9.100668e+05,75.081000,11.468873,694.403333,0.212649,NaN,0.068667,NaN,4.499033,NaN
std,NaN,NaN,NaN,NaN,6.767331,NaN,30752.932523,6.811048e+05,21.396379,5.849092,56.275397,0.147610,NaN,0.252929,NaN,0.725648,NaN
min,NaN,NaN,NaN,NaN,21.000000,NaN,20000.000000,1.000000e+05,12.000000,7.500000,512.000000,0.050000,NaN,0.000000,NaN,1.300000,NaN
25%,NaN,NaN,NaN,NaN,29.000000,NaN,63520.000000,5.768630e+05,60.000000,9.850000,658.000000,0.142000,NaN,0.000000,NaN,4.400000,NaN
50%,NaN,NaN,NaN,NaN,34.000000,NaN,84513.500000,8.538450e+05,76.000000,10.710000,693.000000,0.186000,NaN,0.000000,NaN,4.700000,NaN
75%,NaN,NaN,NaN,NaN,39.000000,NaN,104885.000000,1.118744e+06,90.000000,11.590000,731.000000,0.245000,NaN,0.000000,NaN,5.000000,NaN
max,NaN,NaN,NaN,NaN,57.000000,NaN,202962.000000,9.126093e+06,141.000000,72.676822,887.000000,2.686703,NaN,1.000000,NaN,5.000000,NaN

In [72]:
df['Approval_Status'].value_counts()

Approval_Status
Approved    1947
Rejected     963
approved      61
rejected      29
Name: count, dtype: int64

In [79]:
df['Approval_Status'] = df['Approval_Status'].astype(str).str.capitalize()
df['Approval_Status'].value_counts()

Approval_Status
Approved    2008
Rejected     992
Name: count, dtype: int64

In [85]:
income_city_region = df.groupby(['Region','City'])['Income'].mean().reset_index()
income_summary_sorted = income_city_region.sort_values(by='Income',ascending=False)
income_summary_sorted

   Region       City         Income
6   South    chennai  105391.458333
7   South  hyderabad   97411.423077
5   South  bengaluru   88864.911765
8    West     Mumbai   87489.705703
0   North      Delhi   84790.831740
11   West       pune   84671.357143
3   South    Chennai   84093.296748
9    West       Pune   83957.965839
1   North      delhi   83652.066667
2   South  Bengaluru   83241.405117
4   South  Hyderabad   82396.098451
10   West     mumbai   81543.684211